# 第一步：创建配置文件（config.py），只配一次
CORP_ID = "ww61428878880bbdee"       # 企业微信「我的企业」里查
AGENT_ID = 1000002     # 自建应用的ID，数字格式
SECRET = "yNgi26nEm9bVFd8woyF8TZiE7fZTYheD8tJBIptIWhU"     # 自建应用的密钥
TO_USER = "@all"            # 推送给全员（也可填具体userid，多个用|分隔）

# -*- coding: utf-8 -*-
"""
基金抓取配置文件（所有可配置项集中管理）
"""
# ==================== 基金配置 ====================
ETF_FUND_CODES = ['159819', "515230", "159869", "513160", "518800"]
OTC_FUND_CODES = {
    "科技": ["001104", "001986", "016531", "025209", "014320","018463","011609","023754","018957"],
    "医疗": ["003096", "161726", "019127", "005689"],
    "消费": ["260108"],
    "金融银行": ["180012","013478"],
    "STEADY": ["519732", "008507", "159726", "519133","270042"],
    "制造": ["006154", "010588", "015789","025833"],
    "能源金属": ["019888", "024203","025651"],
    "INTERESTED": ["002112","016020","022365", "003985"]
}
OTC_CRAWL_DAYS = 30

# ==================== 定时配置 ====================
SCHEDULE_TIME = ["14:00", "14:45"]  # 定时执行时间
AUTO_EXIT_TIME = "15:01"            # 每天自动退出时间
GLOBAL_RUN_FLAG = True              # 全局运行开关

# ==================== 环境配置（可根据场景调整） ====================
# 本地环境默认值，main.py中会覆盖
BROWSER_TYPE = "safari"
HEADLESS_MODE = False